WS_SOAP_Java_Client/src/main/resources/wsdl/DocLitWrap/DocLitWrap_Params_ServiceClass.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is JAX-WS RI 2.1.6 in JDK 6. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. 
	RI's version is JAX-WS RI 2.1.6 in JDK 6. -->
<definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://wrap.lit.doc.service.ws.pg.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://wrap.lit.doc.service.ws.pg.com/"
	name="DocLitWrap_Params_ServiceClassService">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://wrap.lit.doc.service.ws.pg.com/"
				schemaLocation="./DocLitWrap_Params_ServiceClass.xsd"></xsd:import>
		</xsd:schema>
	</types>
	<message name="createUser">
		<part name="parameters" element="tns:createUser"></part>
	</message>
	<message name="createUserResponse">
		<part name="parameters" element="tns:createUserResponse"></part>
	</message>
	<portType name="DocLitWrap_Params_ServiceClass">
		<operation name="createUser">
			<input message="tns:createUser"></input>
			<output message="tns:createUserResponse"></output>
		</operation>
	</portType>
	<binding name="DocLitWrap_Params_ServiceClassPortBinding" type="tns:DocLitWrap_Params_ServiceClass">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document"></soap:binding>
		<operation name="createUser">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
	</binding>
	<service name="DocLitWrap_Params_ServiceClassService">
		<port name="DocLitWrap_Params_ServiceClassPort" binding="tns:DocLitWrap_Params_ServiceClassPortBinding">
			<soap:address
				location="http://localhost:6001/doclitwrapparam/DocLitWrap_Params_ServiceClass"></soap:address>
		</port>
	</service>
</definitions>